# CONFIGURATION
cask_args appdir: "/Applications"

# BREWS
brew "asciinema"
brew "aspell"
brew "awscli"
brew "azure-cli"
brew "circleci"
brew "go"
brew "graphviz"
brew "hugo"
brew "jq"
brew "kubernetes-cli"
brew "mas"
brew "midnight-commander"
brew "mitmproxy"
brew "mysql-client"
brew "node@10"
brew "nvm"
brew "packer"
brew "shellcheck"
brew "terraform"
brew "terraformer"
brew "tmux"
brew "tree"
brew "wget"
brew "watchman"
brew "youtube-dl"

# UPSTREAM TAPS
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# CUSTOM TAPS
tap "buo/cask-upgrade" # see https://github.com/buo/homebrew-cask-upgrade
tap "instrumenta/instrumenta" # see https://github.com/instrumenta/homebrew-instrumenta

# CASKS
cask "adobe-creative-cloud"
cask "calibre"
cask "google-chrome"
cask "qlstephen"
cask "virtualbox"
cask "aerial"
cask "deckset"
cask "google-cloud-sdk"
cask "keybase"
cask "postman"
cask "quicklook-csv"
cask "visual-studio-code"
cask "amazon-workdocs"
cask "docker-edge"
cask "knox"
cask "provisionql"
cask "quicklook-json"
cask "synology-cloud-station-drive"
cask "vlc"
cask "atext"
cask "the-unarchiver"
cask "balsamiq-mockups"
cask "grammarly"
cask "logitech-options"
cask "qlcolorcode"
cask "screenflow"
cask "torbrowser"
cask "bartender"
cask "etcher"
cask "grandperspective"
cask "moneymoney"
cask "qlimagesize"
cask "sequel-pro"
cask "transmission"
cask "betterzipql"
cask "qlmarkdown"
cask "skim"
cask "transmit"
cask "beyond-compare"
cask "horndis"
cask "qlprettypatch"
cask "vagrant"

# App Store
mas "1Password 7", id: 1333542190
mas "BeatGauge", id: 974010176
mas "Divvy", id: 413857545
mas "Final Cut Pro", id: 424389933
mas "DuplicateFilesCleaner", id: 1031826818
mas "Grammarly for Safari", id: 1462114288
mas "Graphic", id: 404705039
mas "Keynote", id: 409183694
mas "Lungo", id: 1263070803
mas "Navicat Premium Essentials", id: 466416967
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "Patterns", id: 429449079
mas "Pixelmator", id: 407963104
mas "Spark", id: 1176895641
mas "Tyme2", id: 1063996724
mas "Xcode", id: 497799835